Конфигурация/DataProcessors/ПечатьСведенийОФизЛицеИЕгоИИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьСведенийОФизЛицеИЕгоИИС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ВводыВыводыАктивовВВалютеУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВводыВыводыАктивовВВалютеУчета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БалансоваяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РыночнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацииВводаВыводаДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/КодыВТорговыхСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыВТорговыхСистемах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
						<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКодовВТорговыхСистемах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыФизическихЛицАнкетные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыФизическихЛицАнкетные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействияУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийУдостоверениеЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОрганаВыдавшегоУдостоверениеЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВтороеГражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРНИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРНИП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРНИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресРегистрацииФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресМестаЖительства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресМестаЖительстваФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентПо173ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДляОповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСтраница</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccountingRegisters/НалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccountingRegister>
		<Properties>
			<Name>НалоговыйУчет</Name>
			<ChartOfAccounts>ChartOfAccounts.Основной</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Основной.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Основной.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпераций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиБухгалтерскогоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Конфигурация/DataProcessors/ПечатьСведенийОФизЛицеИЕгоИИС/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);

КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьТаблицуНеоблагаемых()
	
	ТабНеоблагаемые = Новый ТаблицаЗначений();
	ТабНеоблагаемые.Колонки.Добавить("Описание");
	ТабНеоблагаемые.Колонки.Добавить("Область");
	ТабНеоблагаемые.Колонки.Добавить("Сумма");
	
	НовСтрока = ТабНеоблагаемые.Добавить();
	НовСтрока.Описание = "НКД государственных и муниципальных облигаций";
	НовСтрока.Область = "П08010000";
	НовСтрока.Сумма = 0;
	
	НовСтрока = ТабНеоблагаемые.Добавить();
	НовСтрока.Описание = "Доход от индексации номинала";
	НовСтрока.Область = "П08020000";
	НовСтрока.Сумма = 0;
	
	НовСтрока = ТабНеоблагаемые.Добавить();
	НовСтрока.Описание = "НКД корпоративных облигаций, номинированных в рублях и эмитированных после 1 января 2017 г.";
	НовСтрока.Область = "П08030000";
	НовСтрока.Сумма = 0;
	
	НовСтрока = ТабНеоблагаемые.Добавить();
	НовСтрока.Описание = "Проценты по депозитам";
	НовСтрока.Область = "П08040000";
	НовСтрока.Сумма = 0;
	
	НовСтрока = ТабНеоблагаемые.Добавить();
	НовСтрока.Описание = "Проценты по МНО";
	НовСтрока.Область = "П08050000";
	НовСтрока.Сумма = 0;
	
	НовСтрока = ТабНеоблагаемые.Добавить();
	НовСтрока.Описание = "Реализация ценных бумаг, находящихся в собственности более 3-х лет";
	НовСтрока.Область = "П08060100";
	НовСтрока.Сумма = 0;
	
	НовСтрока = ТабНеоблагаемые.Добавить();
	НовСтрока.Описание = "Реализация ценных бумаг, находящихся в собственности более 5-ти лет";
	НовСтрока.Область = "П08060200";
	НовСтрока.Сумма = 0;
	
	НовСтрока = ТабНеоблагаемые.Добавить();
	НовСтрока.Описание = "Доход по ценным бумагам, являющимися ценными бумагами высокотехнологичного сектора экономики";
	НовСтрока.Область = "П08060300";
	НовСтрока.Сумма = 0;
	
	НовСтрока = ТабНеоблагаемые.Добавить();
	НовСтрока.Описание = "Дивиденды по акциям";
	НовСтрока.Область = "П08070000";
	НовСтрока.Сумма = 0;
	
	НовСтрока = ТабНеоблагаемые.Добавить();
	НовСтрока.Описание = "Положительная курсовая разница";
	НовСтрока.Область = "П08080000";
	НовСтрока.Сумма = 0;
			
	Возврат ТабНеоблагаемые;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ВернутьДатуПервогоВывода(СчетДУ, Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВводыВыводыАктивовВВалютеУчетаОбороты.Период КАК Дата,
	|	ВводыВыводыАктивовВВалютеУчетаОбороты.Регистратор КАК ДокументВывод,
	|	ВЫБОР
	|		КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.Регистратор ССЫЛКА Документ.ВыводЦенныхБумаг
	|			ТОГДА ИСТИНА
	|		КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.Регистратор ССЫЛКА Документ.ВыводДенежныхСредств
	|				И ВводыВыводыАктивовВВалютеУчетаОбороты.ВидОперацииВводаВыводаДС = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДенежныхСредствСПереводомВсехАктивовНаДругойИИС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Статус
	|ИЗ
	|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДУ);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтатусПроверки = Истина;
	
	Пока Выборка.Следующий() Цикл
		СтатусПроверки = (СтатусПроверки И Выборка.Статус);
		Если НЕ Выборка.Статус Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + Выборка.ДокументВывод + " имеет вид операции отличный от " + Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДенежныхСредствСПереводомВсехАктивовНаДругойИИС);
			ДатаПервогоВывода = Неопределено;
		КонецЕсли;
		
		Если СтатусПроверки Тогда  //в запросе упорядочено по убыванию.
			ДатаПервогоВывода = Выборка.Дата;
		КонецЕсли;			
	КонецЦикла;
	
	Если ДатаПервогоВывода = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У ИСС " + СчетДУ + " нет выводов денежных средств и/или выводов ценных бумаг");
	КонецЕсли;	
		
	Возврат ДатаПервогоВывода;
	
КонецФункции 	

&НаСервереБезКонтекста
Функция ВернутьДатуРасчетаНДФЛ(СчетДУ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(МАКСИМУМ(РасчетНДФЛ.ДатаРасчета), НЕОПРЕДЕЛЕНО) КАК Дата
	|ИЗ
	|	Документ.РасчетНДФЛ КАК РасчетНДФЛ
	|ГДЕ
	|	РасчетНДФЛ.ОснованиеРасчета = ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику)
	|	И РасчетНДФЛ.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И НЕ РасчетНДФЛ.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДУ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Дата;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции 	

&НаСервере
Функция ВернутьСведенияОЦенныхБумагах(ДатаНачальная, ДатаКонечная)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	КодыВТорговыхСистемахСрезПоследних.Код КАК ISIN,
	|	БухПартииЦенныхБумаг.Партия КАК Партия,
	|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
	|	БухПартииЦенныхБумаг.Партия.Дата КАК ДатаПокупки,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумаг.Партия) = ТИП(Документ.Сделка)
	|			ТОГДА БухПартииЦенныхБумаг.Партия.НомерСделки
	|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумаг.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
	|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумаг.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание.НомерСделки
	|	КОНЕЦ КАК НомерСделки,
	|	БухПартииЦенныхБумаг.Количество КАК Количество,
	|	БухПартииЦенныхБумаг.Партия.ВалютаСделки КАК Валюта,
	|	ВЫБОР
	|		КОГДА БухПартииЦенныхБумаг.Количество > 0
	|			ТОГДА (БухПартииЦенныхБумаг.Стоимость - БухПартииЦенныхБумаг.РасходыПриПокупкеВСтоимости) / БухПартииЦенныхБумаг.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьПокупки,
	|	БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета КАК СтоимостьКупона,
	|	БухПартииЦенныхБумаг.РасходыПриПокупкеВСтоимостиВВалютеУчета КАК РасходыПриПокупке,
	|	БухПартииЦенныхБумаг.СтоимостьВВалютеУчета + БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета КАК Стоимость
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних КАК КодыВТорговыхСистемахСрезПоследних
	|		ПО БухПартииЦенныхБумаг.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
	|			И (КодыВТорговыхСистемахСрезПоследних.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN))
	|ГДЕ
	|	БухПартииЦенныхБумаг.Организация = &Организация
	|	И БухПартииЦенныхБумаг.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
	|	И БухПартииЦенныхБумаг.Период МЕЖДУ &ПериодНачало И &ПериодКонец
	|	И БухПартииЦенныхБумаг.Регистратор ССЫЛКА Документ.ВыводЦенныхБумаг
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦеннаяБумага,
	|	Партия,
	|	СтрокаПартии
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(СтоимостьКупона),
	|	СУММА(РасходыПриПокупке),
	|	СУММА(Стоимость)
	|ПО
	|	ОБЩИЕ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ПериодНачало", ДатаНачальная);
	Запрос.УстановитьПараметр("ПериодКонец", КонецДня(ДатаКонечная));
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//СтоимостьПокупки в валюте. 
	// остальные покаказатели в рублях. 
	
	Возврат Выборка;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ВыбратьДанныеИзТабличногоДокумента(ТабДокОтчет, ТабНеоблагаемые)
	
	Для Каждого СтрНеоблагаемые из ТабНеоблагаемые Цикл 
		ИмяОбласти = СтрНеоблагаемые.Область;
		Если ТабДокОтчет.Области.Найти(ИмяОбласти) <> Неопределено Тогда 
			Значение = ТабДокОтчет.Области[ИмяОбласти].Значение;
			СтрНеоблагаемые.Сумма = СтрНеоблагаемые.Сумма + Значение;
		КонецЕсли;	
	КонецЦикла;			
	
КонецПроцедуры	

&НаСервере
Процедура СформироватьСведенияОФЛиИИСНаСервере()
	
	Результат.Очистить();
	
	ДатаРасчетаНДФЛ = ВернутьДатуРасчетаНДФЛ(Объект.СчетДоверительногоУправления);
	Если ДатаРасчетаНДФЛ = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У ИСС " + Объект.СчетДоверительногоУправления + " нет расчета НДФЛ на перевод активов другому профучастнику");
		Возврат 
	КонецЕсли;
			
	ДатаПервогоВывода = ВернутьДатуПервогоВывода(Объект.СчетДоверительногоУправления, Объект.Организация);
	Если ДатаПервогоВывода = Неопределено Тогда 
		Возврат; 
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	#Область Текст_запроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК ФИО,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.МестоРождения КАК МестоРождения,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресРегистрации КАК АдресРегистрации,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности КАК ВидУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности КАК СерияУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности КАК НомерУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ДатаВыдачиУдостоверенияЛичности КАК ДатаВыдачиУдостоверенияЛичности,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.КодОрганаВыдавшегоУдостоверениеЛичности КАК КодОрганаВыдавшегоУдостоверениеЛичности
		|ПОМЕСТИТЬ _РеквизитыФизЛица
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Дата, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КПП КАК КПП,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮридическийАдрес КАК ЮридическийАдрес,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Телефоны КАК Телефоны
		|ПОМЕСТИТЬ _РеквизитыПрофучастника
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|ГДЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо = &ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения
		|ПОМЕСТИТЬ _РеквизитыДоговораИИС
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА РасчетНДФЛНалоговаяБаза.Год = 0
		|			ТОГДА ГОД(РасчетНДФЛНалоговаяБаза.Ссылка.ДатаРасчета)
		|		ИНАЧЕ РасчетНДФЛНалоговаяБаза.Год
		|	КОНЕЦ КАК Год,
		|	РасчетНДФЛНалоговаяБаза.ВидДоходаВычета КАК КодДохода,
		|	РасчетНДФЛНалоговаяБаза.Сумма КАК СуммаДохода
		|ПОМЕСТИТЬ _НОБДоходы
		|ИЗ
		|	Документ.РасчетНДФЛ.НалоговаяБаза КАК РасчетНДФЛНалоговаяБаза
		|ГДЕ
		|	РасчетНДФЛНалоговаяБаза.Ссылка.Организация = &Организация
		|	И РасчетНДФЛНалоговаяБаза.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РасчетНДФЛНалоговаяБаза.Ссылка.ОснованиеРасчета В (ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику), ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода))
		|	И ТИПЗНАЧЕНИЯ(РасчетНДФЛНалоговаяБаза.ВидДоходаВычета) = ТИП(Справочник.ВидыДоходовНДФЛ)
		|	И НЕ РасчетНДФЛНалоговаяБаза.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА РасчетНДФЛНалоговаяБаза.Год = 0
		|			ТОГДА ГОД(РасчетНДФЛНалоговаяБаза.Ссылка.ДатаРасчета)
		|		ИНАЧЕ РасчетНДФЛНалоговаяБаза.Год
		|	КОНЕЦ КАК Год,
		|	РасчетНДФЛНалоговаяБаза.ВидДоходаВычета КАК КодВычета,
		|	-РасчетНДФЛНалоговаяБаза.Сумма КАК СуммаВычета
		|ПОМЕСТИТЬ _НОБВычеты
		|ИЗ
		|	Документ.РасчетНДФЛ.НалоговаяБаза КАК РасчетНДФЛНалоговаяБаза
		|ГДЕ
		|	РасчетНДФЛНалоговаяБаза.Ссылка.Организация = &Организация
		|	И РасчетНДФЛНалоговаяБаза.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РасчетНДФЛНалоговаяБаза.Ссылка.ОснованиеРасчета В (ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику), ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода))
		|	И ТИПЗНАЧЕНИЯ(РасчетНДФЛНалоговаяБаза.ВидДоходаВычета) = ТИП(Справочник.ВидыВычетовНДФЛ)
		|	И НЕ РасчетНДФЛНалоговаяБаза.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НалоговыйУчетОбороты.СуммаОборотКт КАК СуммаВвода
		|ПОМЕСТИТЬ _Суммы
		|ИЗ
		|	РегистрБухгалтерии.НалоговыйУчет.Обороты(
		|			&НачалоГода,
		|			&Дата,
		|			,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоДоговоруДоверительногоУправленияИмуществом),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
		|			,
		|			) КАК НалоговыйУчетОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.Должность КАК Должность,
		|	КонтактныеЛица.ОснованиеПолномочий КАК ОснованиеПолномочий,
		|	КонтактныеЛица.КонтактноеЛицо.Наименование КАК Ответственный
		|ПОМЕСТИТЬ _РеквизитыПодписанта
		|ИЗ
		|	РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|	И КонтактныеЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|	И КонтактныеЛица.Объект = &ЮрФизЛицо
		|	И КонтактныеЛица.КонтактноеЛицо = &Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.Должность КАК Должность,
		|	КонтактныеЛица.ОснованиеПолномочий КАК ОснованиеПолномочий,
		|	КонтактныеЛица.КонтактноеЛицо.Наименование КАК КонтактноеЛицо
		|ПОМЕСТИТЬ _РеквизитыИсполнителя
		|ИЗ
		|	РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|	И КонтактныеЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|	И КонтактныеЛица.Объект = &ЮрФизЛицо
		|	И КонтактныеЛица.КонтактноеЛицо = &Исполнитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетНДФЛ.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _Расчеты
		|ИЗ
		|	Документ.РасчетНДФЛ КАК РасчетНДФЛ
		|ГДЕ
		|	РасчетНДФЛ.Организация = &Организация
		|	И РасчетНДФЛ.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РасчетНДФЛ.ОснованиеРасчета В (ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.ПереводАктивовДругомуПрофучастнику), ЗНАЧЕНИЕ(Перечисление.ОснованияРасчетаНДФЛ.КонецНалоговогоПериода))
		|	И НЕ РасчетНДФЛ.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.БалансоваяСтоимостьОборот КАК Сумма
		|ПОМЕСТИТЬ _ВыводыДС
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			,
		|			,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидОперацииВводаВыводаДС = ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДенежныхСредствСПереводомВсехАктивовНаДругойИИС)) КАК ВводыВыводыАктивовВВалютеУчетаОбороты";
	#КонецОбласти
	
	// запросы НОБДоходы и НОБВычеты, поле Год
	// с 2021 года поле появилось в документе. В документе расторжения будет база в все годы действия договора
	// старая схема: на каждый год действия создается свой документ. 
	
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Дата", ДатаРасчетаНДФЛ);
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ДатаРасчетаНДФЛ));
	Запрос.УстановитьПараметр("ДатаПервогоВывода", Новый Граница(ДатаПервогоВывода, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ЮрФизЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ЮрФизЛицо"));
	Запрос.УстановитьПараметр("Ответственный",Объект.Подписант);
	Запрос.УстановитьПараметр("Исполнитель",Объект.Исполнитель);

	РезультатЗапроса = Запрос.Выполнить();
	
	Макет =  Обработки.ПечатьСведенийОФизЛицеИЕгоИИС.ПолучитьМакет("СведенияОФизЛицеИЕгоИИС");	
	
	Результат.Вывести(РаботаСОтчетами.ПолучитьШапкуОфициальногоБланкаОрганизации(Объект.Организация, ДатаРасчетаНДФЛ));
	
	Область = Макет.ПолучитьОбласть("Шапка");
	
	//Сумма вывода
	СуммаВывода = 0;
	ВыборкаВыводыДС = МВТ.Таблицы.Найти("_ВыводыДС").ПолучитьДанные().Выбрать();
	Если ВыборкаВыводыДС.Следующий() Тогда 
		СуммаВывода = ВыборкаВыводыДС.Сумма;
	КонецЕсли;	
	
	ВыборкаПФ = МВТ.Таблицы.Найти("_РеквизитыПрофучастника").ПолучитьДанные().Выбрать();
	Если ВыборкаПФ.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаПФ);
	КонецЕсли;	
	
	Результат.Вывести(Область);
	
	//сведения о Физическом лице
	Область = Макет.ПолучитьОбласть("Раздел1");
	ВыборкаФЛ = МВТ.Таблицы.Найти("_РеквизитыФизЛица").ПолучитьДанные().Выбрать();
	Если ВыборкаФЛ.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаФЛ);
		ДокументУдостоверениеЛичности = СокрЛП(ВыборкаФЛ.ВидУдостоверенияЛичности) + " " + 
		ВыборкаФЛ.СерияУдостоверенияЛичности + " " + ВыборкаФЛ.НомерУдостоверенияЛичности + ", Выдан " + 
		Формат(ВыборкаФЛ.ДатаВыдачиУдостоверенияЛичности, "ДФ=dd.MM.yyyy") + ", код подразделения " + ВыборкаФЛ.КодОрганаВыдавшегоУдостоверениеЛичности;
		Область.Параметры.Документ = ДокументУдостоверениеЛичности;
	КонецЕсли;	
	Результат.Вывести(Область);
	
	//сведения о профучастнике 
	Область = Макет.ПолучитьОбласть("Раздел2");
	ВыборкаПФ.Сбросить();
	Если ВыборкаПФ.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаПФ);
		Область.Параметры.ИННКПП = ВыборкаПФ.ИНН + "/" + ВыборкаПФ.КПП;
	КонецЕсли;		
	Результат.Вывести(Область);
	
	//сведения о договоре ИИС
	Область = Макет.ПолучитьОбласть("Раздел3");
	ВыборкаИИС = МВТ.Таблицы.Найти("_РеквизитыДоговораИИС").ПолучитьДанные().Выбрать();
	Если ВыборкаИИС.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаИИС);
		Договор = "Договор №"+ВыборкаИИС.НомерДоговора + " от " + Формат(ВыборкаИИС.ДатаЗаключения, "ДФ=dd.MM.yyyy"); 
		Область.Параметры.Договор = Договор;
		//ПериодИСС = Формат(ВыборкаИИС.ДатаЗаключения, "ДФ=dd.MM.yyyy") + " - " + Формат(ВыборкаИИС.ДатаРасторжения, "ДФ=dd.MM.yyyy");
		Область.Параметры.Период = Формат(Год(ВыборкаИИС.ДатаРасторжения),"ЧГ=0");
	КонецЕсли;	
	Область.Параметры.СуммаВывода =  СуммаВывода; 
	
	СуммаВнесенная = 0;
	ВыборкаСуммаВвода = МВТ.Таблицы.Найти("_Суммы").ПолучитьДанные().Выбрать();
	Если ВыборкаСуммаВвода.Следующий() Тогда 
		СуммаВнесенная = ВыборкаСуммаВвода.СуммаВвода; 
	КонецЕсли;	
	Область.Параметры.СуммаВнесенная = СуммаВнесенная; 
	Результат.Вывести(Область);
		
	//НОБ
	ОбластьГод = Макет.ПолучитьОбласть("СтрокаНОБ");
	ОбластьНОБ = Макет.ПолучитьОбласть("СуммыНОБ");	
	
	НОБДоходы = МВТ.Таблицы.Найти("_НОБДоходы").ПолучитьДанные().Выгрузить();
	НОБВычеты = МВТ.Таблицы.Найти("_НОБВычеты").ПолучитьДанные().Выгрузить();
	
	ГодОт = Год(ВыборкаИИС.ДатаЗаключения);
	ГодДо = Год(ДатаРасчетаНДФЛ);
		
	Для ГодРасчета=ГодОт по ГодДо Цикл 
		
		ОбластьГод.Параметры.Год = Формат(ГодРасчета, "ЧГ=0"); 
		Результат.Вывести(ОбластьГод);
		
		СтрокиДоходы = НОБДоходы.НайтиСтроки(Новый Структура ("Год", ГодРасчета));
		СтрокиВычеты = НОБВычеты.НайтиСтроки(Новый Структура ("Год", ГодРасчета));
		
		КолвоСтрокДоходов = СтрокиДоходы.Количество();
		КолвоСтрокВычетов = СтрокиВычеты.Количество();
		Для инд = 1 по Макс(КолвоСтрокДоходов, КолвоСтрокВычетов) Цикл 
			Если инд <= КолвоСтрокДоходов Тогда 
				ОбластьНОБ.Параметры.КодДохода = СтрокиДоходы[инд-1].КодДохода;
				ОбластьНОБ.Параметры.СуммаДохода = СтрокиДоходы[инд-1].СуммаДохода;
			Иначе
				ОбластьНОБ.Параметры.КодДохода = "";
				ОбластьНОБ.Параметры.СуммаДохода = 0;				
			КонецЕсли;	
			Если инд <= КолвоСтрокВычетов Тогда 
				ОбластьНОБ.Параметры.КодВычета = СтрокиВычеты[инд-1].КодВычета;
				ОбластьНОБ.Параметры.СуммаВычета = СтрокиВычеты[инд-1].СуммаВычета;
			Иначе
				ОбластьНОБ.Параметры.КодВычета = "";
				ОбластьНОБ.Параметры.СуммаВычета = 0;				
			КонецЕсли;
			
			Результат.Вывести(ОбластьНОБ);			
		КонецЦикла;
	КонецЦикла;	
		
	Область = Макет.ПолучитьОбласть("РазделЦБ");
	Результат.Вывести(Область);
	
	Выборка = ВернутьСведенияОЦенныхБумагах(ДатаПервогоВывода, ДатаРасчетаНДФЛ);
	
	Если Выборка.Следующий() Тогда
		ОбластьСтр = Макет.ПолучитьОбласть("СтрокаЦБ");

		ВыборкаЦБ = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой); 
		Пока ВыборкаЦБ.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтр.Параметры, ВыборкаЦБ); 			
			Результат.Вывести(ОбластьСтр);
		КонецЦикла;
		
		ОбластьИтогЦБ = Макет.ПолучитьОбласть("ИтогЦБ");
		ЗаполнитьЗначенияСвойств(ОбластьИтогЦБ.Параметры, Выборка);
		Результат.Вывести(ОбластьИтогЦБ);
	Иначе 
		Область = Макет.ПолучитьОбласть("СтрокаЦБ");
		Результат.Вывести(Область);			
	КонецЕсли;
		
	Область = Макет.ПолучитьОбласть("Раздел3_Суммы");
	Область.Параметры.СуммаВывода = СуммаВывода; 
	
	 //необлагаемые налогом
	 //с декабря 2019 г. изменились правила расчета. Документы по старым периодам могут иначе посчитать доход
	 // поэтому данные для этого раздела берем из существующих документов.
	 // очередные изменения с 2021 г.
	ТабНеоблагаемые = СоздатьТаблицуНеоблагаемых();
	
	//из каждого документа возьмем табличный документ и заполним таблицу
	ДокРасчеты = МВТ.Таблицы.Найти("_Расчеты").ПолучитьДанные().Выгрузить();
	Для Каждого ДокументРасчет из ДокРасчеты Цикл 
		ДанныеОтчетаТекущие = ДокументРасчет.Ссылка.ДанныеОтчета.Получить();
		Если ТипЗнч(ДанныеОтчетаТекущие) = Тип("ТабличныйДокумент") Тогда  
			ВыбратьДанныеИзТабличногоДокумента(ДанныеОтчетаТекущие, ТабНеоблагаемые);
			//старая схема. храним только один отчет
		ИначеЕсли ТипЗнч(ДанныеОтчетаТекущие) = Тип("Структура") Тогда 
			Для Каждого ЗначениеСтруктуры из ДанныеОтчетаТекущие Цикл 
				ВыбратьДанныеИзТабличногоДокумента(ЗначениеСтруктуры.Значение, ТабНеоблагаемые);
			КонецЦикла;	
			//с 2021. Храним документы на каждый год. 
		КонецЕсли;	
	КонецЦикла;
	
	//выводим данные из таблицы
	ДопИнфа = ""; Нумератор = 0;
	Для Каждого СтрНеоблагаемые ИЗ ТабНеоблагаемые Цикл 
		Если СтрНеоблагаемые.Сумма > 0 Тогда 
			Нумератор = Нумератор + 1; 
			ДопИнфа = ДопИнфа + Нумератор + ". " + СтрНеоблагаемые.Описание + " - " + Формат(СтрНеоблагаемые.Сумма,"ЧДЦ=2")+ Символы.ПС;  
		КонецЕсли;
	КонецЦикла;	
	
	Область.Параметры.ДопИнфа = ДопИнфа;
	Результат.Вывести(Область);
	
	// не заполняется
	Область = Макет.ПолучитьОбласть("Раздел4");
	Результат.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("СтрокаДоки");
	Результат.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Раздел4_Иные");
	Результат.Вывести(Область);
	
	
	Область = Макет.ПолучитьОбласть("Подпись");
	ВыборкаПодписант = МВТ.Таблицы.Найти("_РеквизитыПодписанта").ПолучитьДанные().Выбрать();
	Если ВыборкаПодписант.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаПодписант);
		Результат.Вывести(Область);
	КонецЕсли;	
	
	Область = Макет.ПолучитьОбласть("Исполнитель");
	ВыборкаИсполнитель = МВТ.Таблицы.Найти("_РеквизитыИсполнителя").ПолучитьДанные().Выбрать();
	Если ВыборкаИсполнитель.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаИсполнитель);
		Результат.Вывести(Область);
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечать(Команда)
	СформироватьСведенияОФЛиИИСНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Если ЭтаФорма.Параметры.Свойство("СчетДоверительногоУправления") Тогда 
		Объект.СчетДоверительногоУправления = ЭтаФорма.Параметры.СчетДоверительногоУправления;
		Если Объект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать сведений возможно только для договора ИСС",,,,Отказ);
			Возврат;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКонтакноеЛицо(Элемент)
	
	Если Элемент.Имя = "Подписант" Тогда 
		Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Объект.Организация, Объект.Подписант));	
	ИначеЕсли Элемент.Имя = "Исполнитель" Тогда
		Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Объект.Организация, Объект.Исполнитель));
	КонецЕсли;	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ВыбратьКонтакноеЛицо(Элемент);
		
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ВыбратьКонтакноеЛицо(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеКонтактногоЛица(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("РегистрСведенийКлючЗаписи.КонтактныеЛица") Тогда
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);	
		ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;	
	КонецЕсли;		
	
КонецПроцедуры	

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УстановитьЗначениеКонтактногоЛица(ВыбранноеЗначение);
			
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УстановитьЗначениеКонтактногоЛица(ВыбранноеЗначение);
			
КонецПроцедуры
